app/controllers/events_controller.rb

SELECT "events".* FROM "events" WHERE "events"."user_id" = $1  [["user_id", 2]]
---
  def index
    # @events = Event.all
    @events = current_user.events.all

INSERT INTO "events" ("name", "description", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "PYRAMIDS"], ["description", "GO"], ["created_at", "2017-10-19 18:10:39.696289"], ["updated_at", "2017-10-19 18:10:39.696289"]]
---
  def create
    # @event = Event.new(event_params)
    @event = current_user.events.build(event_params)
    # @events = current_user.events.build(event_params)

    if @event.save

UPDATE "events" SET "description" = $1, "event_type" = $2, "event_category" = $3, "time_required" = $4, "details" = $5, "location" = $6, "updated_at" = $7 WHERE "events"."id" = $8  [["description", "h"], ["event_type", "g"], ["event_category", "g"], ["time_required", "h"], ["details", "h"], ["location", "h"], ["updated_at", "2017-10-22 01:37:37.361685"], ["id", 58]]
---
  def update
    # if @event.update(event_params)
    if @event.current_user.events.update(event_params)